app/views/messages/create.json.jbuilder

json.user_name @message.user.name
json.date @message.created_at.strftime('%y/%m/%d %H:%M')
---
INSERT INTO `messages` (`text`, `image`, `user_id`, `group_id`, `created_at`, `updated_at`) VALUES ('', '20170817115310.jpg', 5, 34, '2017-08-17 02:53:10', '2017-08-17 02:53:10')