app/views/groups/_form.html.haml

      .chat-group-form__field--right
        = f.collection_check_boxes :user_ids, User.all, :id, :name
    .chat-group-form__field.clearfix
      .chat-group-form__field--right
---
SELECT `users`.* FROM `users`