app/views/groups/_group.html.haml

    .group__message
      - if group.messages.last.blank?
---
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 27 ORDER BY `messages`.`id` DESC LIMIT 1