app/controllers/groups_controller.rb

  def index
    @groups = current_user.groups
---
SELECT `groups`.* FROM `groups` INNER JOIN `members` ON `groups`.`id` = `members`.`group_id` WHERE `members`.`user_id` = 5

  def edit
    @group = Group.find(params[:id])
    if @group.members.count != 1  #グループのメンバーが自分以外にも存在するとき
      @members = @group.members.includes(:user).without_me(current_user.id)
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 20 LIMIT 1
SELECT COUNT(*) FROM `members` WHERE `members`.`group_id` = 38
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `groups`.* FROM `groups` INNER JOIN `members` ON `members`.`group_id` = `groups`.`id`
SELECT `members`.* FROM `members` WHERE `members`.`group_id` = 39 AND (user_id not 5)

  def update
    @group = Group.find(params[:id])
    if @group.members.count != 1  #グループのメンバーが自分以外にも存在するとき
      @members = @group.members.includes(:user).without_me(current_user.id)
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 38 LIMIT 1
SELECT COUNT(1) FROM `members` WHERE `members`.`group_id` = 39
SELECT `members`.* FROM `members` WHERE `members`.`group_id` = 39 AND (user_id != 5)
SELECT `users`.* FROM `users` INNER JOIN `members` ON `users`.`id` = `members`.`user_id` WHERE `members`.`group_id` = 38