app/controllers/messages_controller.rb

INSERT INTO `messages` (`text`, `image`, `user_id`, `group_id`, `created_at`, `updated_at`) VALUES ('', '20170817115310.jpg', 5, 34, '2017-08-17 02:53:10', '2017-08-17 02:53:10')
---
  def create
    message = current_user.messages.new(message_params)
    if message.save

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 27 LIMIT 1
SELECT `groups`.* FROM `groups` INNER JOIN `members` ON `groups`.`id` = `members`.`group_id` WHERE `members`.`user_id` = 5
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 27 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `members`.* FROM `members` WHERE `members`.`group_id` = 27
---
  def set_variables
    @group = Group.find(params[:group_id])
    @groups = current_user.groups
    @message = Message.new
    @messages = @group.messages.includes(:user)
    @members = @group.members.includes(:user)