app/controllers/users_controller.rb

  def edit
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 ORDER BY `users`.`id` ASC LIMIT 1

  def update
    @user = User.find(params[:id])
    if  @user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `name` = 'aaaaaaaaaa', `email` = 'paomarrrrrrrr@yahoo.co.jp', `updated_at` = '2017-06-20 04:01:50' WHERE `users`.`id` = 5